esp8266/Arduino/hardware/arduino/esp8266/boards.txt
##############################################################
esp01.name=Generic ESP8266 board (80MHz)

esp01.upload.tool=esptool
esp01.upload.speed=115200
esp01.upload.maximum_size=524288
esp01.upload.wait_for_upload_port=true

esp01.build.mcu=esp8266
esp01.build.f_cpu=80000000L
esp01.build.board=ESP8266_ESP01
esp01.build.core=esp8266
esp01.build.variant=esp01
